#include <iostream>
#include <random>
#include <vector>
#include <string>

std::vector<std::string> maja = {
    "点1", "点2", "点3", "点4", "点5", "点6", "点7", "点8", "点9",
    "点1", "点2", "点3", "点4", "点5", "点6", "点7", "点8", "点9",
    "点1", "点2", "点3", "点4", "点5", "点6", "点7", "点8", "点9",
    "点1", "点2", "点3", "点4", "点5", "点6", "点7", "点8", "点9",

    "划1", "划2", "划3", "划4", "划5", "划6", "划7", "划8", "划9",
    "划1", "划2", "划3", "划4", "划5", "划6", "划7", "划8", "划9", 
    "划1", "划2", "划3", "划4", "划5", "划6", "划7", "划8", "划9", 
    "划1", "划2", "划3", "划4", "划5", "划6", "划7", "划8", "划9", 

    "字1", "字2", "字3", "字4", "字5", "字6", "字7", "字8", "字9",
    "字1", "字2", "字3", "字4", "字5", "字6", "字7", "字8", "字9", 
    "字1", "字2", "字3", "字4", "字5", "字6", "字7", "字8", "字9", 
    "字1", "字2", "字3", "字4", "字5", "字6", "字7", "字8", "字9", 

    "东", "东", "东", "东",
    "西", "西", "西", "西",
    "南", "南", "南", "南",
    "北", "北", "北", "北",
    "中", "中", "中", "中",
    "发", "发", "发", "发",
    "白", "白", "白", "白"
};

int main()
{
    std::random_device rd;
    std::mt19937 gen(rd());
    std::uniform_int_distribution<> dis(1, 136);
    
    for(int i = 0; i < 13; i ++ ) std::cout << maja[dis(gen)] << " ";
    std::cout << std::endl;

    return 0;
}
